#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Announce_EventCine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function Announce_EventCine.Announce_EventCine_C.HandleClientEvent_CinematicFinishedPlaying
// 0x0030 (0x0030 - 0x0000)
struct Announce_EventCine_C_HandleClientEvent_CinematicFinishedPlaying final
{
public:
	class UObject*                                EventSource;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                EventFocus;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       ClientEvent;                                       // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(Announce_EventCine_C_HandleClientEvent_CinematicFinishedPlaying) == 0x000008, "Wrong alignment on Announce_EventCine_C_HandleClientEvent_CinematicFinishedPlaying");
static_assert(sizeof(Announce_EventCine_C_HandleClientEvent_CinematicFinishedPlaying) == 0x000030, "Wrong size on Announce_EventCine_C_HandleClientEvent_CinematicFinishedPlaying");
static_assert(offsetof(Announce_EventCine_C_HandleClientEvent_CinematicFinishedPlaying, EventSource) == 0x000000, "Member 'Announce_EventCine_C_HandleClientEvent_CinematicFinishedPlaying::EventSource' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_HandleClientEvent_CinematicFinishedPlaying, EventFocus) == 0x000008, "Member 'Announce_EventCine_C_HandleClientEvent_CinematicFinishedPlaying::EventFocus' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_HandleClientEvent_CinematicFinishedPlaying, ClientEvent) == 0x000010, "Member 'Announce_EventCine_C_HandleClientEvent_CinematicFinishedPlaying::ClientEvent' has a wrong offset!");

// Function Announce_EventCine.Announce_EventCine_C.ExecuteUbergraph_Announce_EventCine
// 0x00B0 (0x00B0 - 0x0000)
struct Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_SetUIState*            CallFunc_SetUIState_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMediaInfo*                         CallFunc_SpawnObject_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_HandleClientEvent_EventSource;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventFocus;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent;              // 0x0040(0x0020)(ConstParm, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIState                                  CallFunc__BPGetCurrentUIState_ReturnValue;         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_SetUIState*            CallFunc_SetUIState_ReturnValue_1;                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine) == 0x000008, "Wrong alignment on Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine");
static_assert(sizeof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine) == 0x0000B0, "Wrong size on Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, EntryPoint) == 0x000000, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::EntryPoint' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, CallFunc_SetUIState_ReturnValue) == 0x000008, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::CallFunc_SetUIState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, CallFunc_SpawnObject_ReturnValue) == 0x000010, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, Temp_bool_Has_Been_Initd_Variable) == 0x00002C, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, Temp_bool_IsClosed_Variable) == 0x00002D, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, Temp_bool_Has_Been_Initd_Variable_1) == 0x00002E, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, K2Node_HandleClientEvent_EventSource) == 0x000030, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::K2Node_HandleClientEvent_EventSource' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, K2Node_HandleClientEvent_EventFocus) == 0x000038, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::K2Node_HandleClientEvent_EventFocus' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, K2Node_HandleClientEvent_ClientEvent) == 0x000040, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::K2Node_HandleClientEvent_ClientEvent' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000070, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, Temp_bool_IsClosed_Variable_1) == 0x000078, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, K2Node_CreateDelegate_OutputDelegate_2) == 0x00007C, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000090, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, CallFunc__BPGetCurrentUIState_ReturnValue) == 0x000098, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::CallFunc__BPGetCurrentUIState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, CallFunc_SetUIState_ReturnValue_1) == 0x0000A0, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::CallFunc_SetUIState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine, CallFunc_IsValid_ReturnValue_1) == 0x0000A8, "Member 'Announce_EventCine_C_ExecuteUbergraph_Announce_EventCine::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

