#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchmakingOptionsDisplay_v2

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonUI_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.OnSpectateMatch
// 0x0020 (0x0020 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_OnSpectateMatch final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaSpectateMatchModal_C*            CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_OnSpectateMatch) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_OnSpectateMatch");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_OnSpectateMatch) == 0x000020, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_OnSpectateMatch");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_OnSpectateMatch, PassThrough) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_OnSpectateMatch::PassThrough' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_OnSpectateMatch, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_OnSpectateMatch::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_OnSpectateMatch, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000010, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_OnSpectateMatch::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_OnSpectateMatch, CallFunc_Create_ReturnValue) == 0x000018, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_OnSpectateMatch::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.SetScrollWidget
// 0x0008 (0x0008 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_SetScrollWidget final
{
public:
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_SetScrollWidget) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_SetScrollWidget");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_SetScrollWidget) == 0x000008, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_SetScrollWidget");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_SetScrollWidget, CallFunc_GetUINavigationManager_ReturnValue) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_SetScrollWidget::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.OnCustomMatchmaking
// 0x0020 (0x0020 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_OnCustomMatchmaking final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCustomMatchmakingKeyModal_C*           CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_OnCustomMatchmaking) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_OnCustomMatchmaking");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_OnCustomMatchmaking) == 0x000020, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_OnCustomMatchmaking");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_OnCustomMatchmaking, PassThrough) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_OnCustomMatchmaking::PassThrough' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_OnCustomMatchmaking, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_OnCustomMatchmaking::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_OnCustomMatchmaking, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000010, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_OnCustomMatchmaking::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_OnCustomMatchmaking, CallFunc_Create_ReturnValue) == 0x000018, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_OnCustomMatchmaking::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.TriggerMatchmakingPageTileOutroAnim
// 0x0038 (0x0038 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileOutroAnim final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          CallFunc_GetButtonAtIndex_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaMatchmakingTile_C*               K2Node_DynamicCast_AsAthena_Matchmaking_Tile;      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileOutroAnim) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileOutroAnim");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileOutroAnim) == 0x000038, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileOutroAnim");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileOutroAnim, Temp_int_Variable) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileOutroAnim::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileOutroAnim, CallFunc_GetButtonAtIndex_ReturnValue) == 0x000008, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileOutroAnim::CallFunc_GetButtonAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileOutroAnim, K2Node_DynamicCast_AsAthena_Matchmaking_Tile) == 0x000010, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileOutroAnim::K2Node_DynamicCast_AsAthena_Matchmaking_Tile' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileOutroAnim, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileOutroAnim::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileOutroAnim, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileOutroAnim::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileOutroAnim, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileOutroAnim::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileOutroAnim, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileOutroAnim::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.TriggerMatchmakingPageTileIntroAnim
// 0x0040 (0x0040 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileIntroAnim final
{
public:
	class UCommonButton*                          CallFunc_GetButtonAtIndex_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaMatchmakingTile_C*               K2Node_DynamicCast_AsAthena_Matchmaking_Tile;      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileIntroAnim) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileIntroAnim");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileIntroAnim) == 0x000040, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileIntroAnim");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileIntroAnim, CallFunc_GetButtonAtIndex_ReturnValue) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileIntroAnim::CallFunc_GetButtonAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileIntroAnim, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileIntroAnim::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileIntroAnim, K2Node_DynamicCast_AsAthena_Matchmaking_Tile) == 0x000010, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileIntroAnim::K2Node_DynamicCast_AsAthena_Matchmaking_Tile' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileIntroAnim, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileIntroAnim::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileIntroAnim, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileIntroAnim::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileIntroAnim, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileIntroAnim::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileIntroAnim, Temp_int_Variable) == 0x000038, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_TriggerMatchmakingPageTileIntroAnim::Temp_int_Variable' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.Touch To Close
// 0x03B0 (0x03B0 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0160(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_PointerEvent_IsTouchEvent_ReturnValue;    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x017B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0180(0x00B8)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0240(0x00B8)()
	struct FEventReply                            K2Node_Select_Default;                             // 0x02F8(0x00B8)()
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close) == 0x0003B0, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close, MyGeometry) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close, MouseEvent) == 0x000038, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close::MouseEvent' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close, ReturnValue) == 0x0000A8, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000160, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close, CallFunc_PointerEvent_IsTouchEvent_ReturnValue) == 0x000178, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close::CallFunc_PointerEvent_IsTouchEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000179, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close, Temp_bool_Variable) == 0x00017A, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close, CallFunc_BooleanOR_ReturnValue) == 0x00017B, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close, CallFunc_Handled_ReturnValue) == 0x000180, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close, CallFunc_Not_PreBool_ReturnValue) == 0x000238, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close, CallFunc_Unhandled_ReturnValue) == 0x000240, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close, K2Node_Select_Default) == 0x0002F8, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Touch_To_Close::K2Node_Select_Default' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.Handle_InputAction_Cancel
// 0x0001 (0x0001 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_Handle_InputAction_Cancel final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_InputAction_Cancel) == 0x000001, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_Handle_InputAction_Cancel");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_InputAction_Cancel) == 0x000001, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_Handle_InputAction_Cancel");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_InputAction_Cancel, PassThrough) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_InputAction_Cancel::PassThrough' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.SetupInput
// 0x0030 (0x0030 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_SetupInput final
{
public:
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_SetupInput) == 0x000004, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_SetupInput");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_SetupInput) == 0x000030, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_SetupInput");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_SetupInput, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_SetupInput::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_SetupInput, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_SetupInput::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_SetupInput, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_SetupInput::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.SetSquadFillText
// 0x0001 (0x0001 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_SetSquadFillText final
{
public:
	ESquadFillSetting                             InSquadFillSetting;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_SetSquadFillText) == 0x000001, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_SetSquadFillText");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_SetSquadFillText) == 0x000001, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_SetSquadFillText");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_SetSquadFillText, InSquadFillSetting) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_SetSquadFillText::InSquadFillSetting' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.BndEvt__CancelButton_K2Node_ComponentBoundEvent_18_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_18_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_18_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_18_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_18_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_18_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_18_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_18_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.RepresentedPlaylistChanged
// 0x0038 (0x0038 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_RepresentedPlaylistChanged final
{
public:
	struct FPlaylistFrontEndData                  NewRepresentedPlaylist;                            // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_RepresentedPlaylistChanged) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_RepresentedPlaylistChanged");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_RepresentedPlaylistChanged) == 0x000038, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_RepresentedPlaylistChanged");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_RepresentedPlaylistChanged, NewRepresentedPlaylist) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_RepresentedPlaylistChanged::NewRepresentedPlaylist' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.OnTileDoubleClicked
// 0x0008 (0x0008 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_OnTileDoubleClicked final
{
public:
	class UCommonButton*                          ButtonClicked;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_OnTileDoubleClicked) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_OnTileDoubleClicked");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_OnTileDoubleClicked) == 0x000008, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_OnTileDoubleClicked");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_OnTileDoubleClicked, ButtonClicked) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_OnTileDoubleClicked::ButtonClicked' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.UpdateMMButtonStatusBP
// 0x0002 (0x0002 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_UpdateMMButtonStatusBP final
{
public:
	bool                                          bPlaylistIsEnabled;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EFillDisableReason                            FillDisableReason;                                 // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateMMButtonStatusBP) == 0x000001, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_UpdateMMButtonStatusBP");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateMMButtonStatusBP) == 0x000002, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_UpdateMMButtonStatusBP");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateMMButtonStatusBP, bPlaylistIsEnabled) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_UpdateMMButtonStatusBP::bPlaylistIsEnabled' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateMMButtonStatusBP, FillDisableReason) == 0x000001, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_UpdateMMButtonStatusBP::FillDisableReason' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.SetServerAccessText
// 0x0001 (0x0001 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_SetServerAccessText final
{
public:
	EServerAccessSetting                          InServerAccessSetting;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_SetServerAccessText) == 0x000001, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_SetServerAccessText");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_SetServerAccessText) == 0x000001, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_SetServerAccessText");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_SetServerAccessText, InServerAccessSetting) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_SetServerAccessText::InServerAccessSetting' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.SetSpectatorButtonText
// 0x0001 (0x0001 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_SetSpectatorButtonText final
{
public:
	ESpectatorQueueType                           InSpectatorQueueType;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_SetSpectatorButtonText) == 0x000001, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_SetSpectatorButtonText");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_SetSpectatorButtonText) == 0x000001, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_SetSpectatorButtonText");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_SetSpectatorButtonText, InSpectatorQueueType) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_SetSpectatorButtonText::InSpectatorQueueType' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.BndEvt__BacchusCloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__BacchusCloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__BacchusCloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__BacchusCloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__BacchusCloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__BacchusCloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__BacchusCloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__BacchusCloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.BndEvt__SupportAffliateButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__SupportAffliateButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__SupportAffliateButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__SupportAffliateButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__SupportAffliateButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__SupportAffliateButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__SupportAffliateButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__SupportAffliateButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.OnAffiliateUpdated
// 0x0010 (0x0010 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_OnAffiliateUpdated final
{
public:
	class FString                                 AffiliateName;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_OnAffiliateUpdated) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_OnAffiliateUpdated");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_OnAffiliateUpdated) == 0x000010, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_OnAffiliateUpdated");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_OnAffiliateUpdated, AffiliateName) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_OnAffiliateUpdated::AffiliateName' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.UpdateShowSupportAffiliateButton
// 0x0001 (0x0001 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_UpdateShowSupportAffiliateButton final
{
public:
	bool                                          bIsCreativeLTM;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateShowSupportAffiliateButton) == 0x000001, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_UpdateShowSupportAffiliateButton");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateShowSupportAffiliateButton) == 0x000001, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_UpdateShowSupportAffiliateButton");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateShowSupportAffiliateButton, bIsCreativeLTM) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_UpdateShowSupportAffiliateButton::bIsCreativeLTM' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2
// 0x0640 (0x0640 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0050(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable_2;                             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_3;                             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x009C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x00AC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInputActionState                             Temp_byte_Variable_2;                              // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputActionState                             Temp_byte_Variable_3;                              // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue;                   // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCustomMatchmakingKeyEnabled_ReturnValue; // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputActionState                             K2Node_Select_Default;                             // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESquadFillSetting                             Temp_byte_Variable_6;                              // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x00F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_8;                              // 0x00F7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_9;                              // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_10;                             // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_4;                              // 0x0100(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0118(0x0018)()
	EServerAccessSetting                          Temp_byte_Variable_7;                              // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_11;                             // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_12;                             // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_13;                             // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESpectatorQueueType                           Temp_byte_Variable_8;                              // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_6;                              // 0x0138(0x0018)()
	class FText                                   Temp_text_Variable_7;                              // 0x0150(0x0018)()
	class FText                                   Temp_text_Variable_8;                              // 0x0168(0x0018)()
	bool                                          Temp_bool_Variable_14;                             // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_15;                             // 0x0183(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInputActionState                             Temp_byte_Variable_11;                             // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputActionState                             Temp_byte_Variable_12;                             // 0x0185(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_186[0x2];                                      // 0x0186(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue_1;                 // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_16;                             // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLiveSpectatingEnabled_ReturnValue;      // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_13;                             // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputActionState                             K2Node_Select_Default_1;                           // 0x0193(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_14;                             // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_17;                             // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_15;                             // 0x0196(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_16;                             // 0x0197(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue_2;                 // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetAffiliateName_ReturnValue;             // 0x01A0(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue;                          // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESquadFillSetting                             K2Node_Event_InSquadFillSetting;                   // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default_3;                           // 0x01BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_9;                              // 0x01C0(0x0018)()
	class FText                                   Temp_text_Variable_10;                             // 0x01D8(0x0018)()
	class FText                                   Temp_text_Variable_11;                             // 0x01F0(0x0018)()
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_3;               // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0210(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0220(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0230(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0240(0x0010)(ZeroConstructor, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0258(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0260(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FPlaylistFrontEndData                  K2Node_Event_NewRepresentedPlaylist;               // 0x0268(0x0038)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x02A8(0x0088)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0330(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue_1;       // 0x0350(0x0088)()
	class FText                                   CallFunc_TextToUpper_ReturnValue_1;                // 0x03D8(0x0018)()
	class UCommonButton*                          K2Node_Event_ButtonClicked;                        // 0x03F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_12;                             // 0x03F8(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0418(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431[0x3];                                      // 0x0431(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue_1;                        // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0439(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43A[0x2];                                      // 0x043A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue_2;                        // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0440(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_459[0x3];                                      // 0x0459(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue_3;                        // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0460(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue_2;                // 0x0480(0x0018)()
	EFillDisableReason                            Temp_byte_Variable_17;                             // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Temp_object_Variable;                              // 0x04A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_18;                             // 0x04A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4AA[0x6];                                      // 0x04AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button;             // 0x04B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlaylistIsEnabled;                   // 0x04B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFillDisableReason                            K2Node_Event_FillDisableReason;                    // 0x04BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BB[0x5];                                      // 0x04BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_5;                           // 0x04C0(0x0018)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
