#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HeroLoadout

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HeroLoadout.BP_HeroLoadout_C
// 0x0068 (0x02A8 - 0x0240)
class ABP_HeroLoadout_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ADirectionalLight*                      DirectionLight;                                    // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASkyLight*                              SkyLight;                                          // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APointLight*>                    Pointlights;                                       // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
	class AExponentialHeightFog*                  ExponentialHeightFog;                              // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADirectionalLight*                      DirectionalLight_LowDetailMode;                    // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AEmitter*>                       ParticleSystems;                                   // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
	bool                                          IsActive;                                          // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DebugLOWQualityLighting;                           // 0x0291(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASkyLight*                              SkyLight_LowDetailMode;                            // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AExponentialHeightFog*                  ExponentialHeightfog_LowDetailMode;                // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetVisiblityofDetailSpecificMeshes();
	void SetVisiblityofSceneLighting(bool Activate);
	void UserConstructionScript();
	void DisableLobbySetLighting();
	void UpdateSettings();
	void EnableLobbySetLighting();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_HeroLoadout(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HeroLoadout_C">();
	}
	static class ABP_HeroLoadout_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HeroLoadout_C>();
	}
};
static_assert(alignof(ABP_HeroLoadout_C) == 0x000008, "Wrong alignment on ABP_HeroLoadout_C");
static_assert(sizeof(ABP_HeroLoadout_C) == 0x0002A8, "Wrong size on ABP_HeroLoadout_C");
static_assert(offsetof(ABP_HeroLoadout_C, UberGraphFrame) == 0x000240, "Member 'ABP_HeroLoadout_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_HeroLoadout_C, DefaultSceneRoot) == 0x000248, "Member 'ABP_HeroLoadout_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_HeroLoadout_C, DirectionLight) == 0x000250, "Member 'ABP_HeroLoadout_C::DirectionLight' has a wrong offset!");
static_assert(offsetof(ABP_HeroLoadout_C, SkyLight) == 0x000258, "Member 'ABP_HeroLoadout_C::SkyLight' has a wrong offset!");
static_assert(offsetof(ABP_HeroLoadout_C, Pointlights) == 0x000260, "Member 'ABP_HeroLoadout_C::Pointlights' has a wrong offset!");
static_assert(offsetof(ABP_HeroLoadout_C, ExponentialHeightFog) == 0x000270, "Member 'ABP_HeroLoadout_C::ExponentialHeightFog' has a wrong offset!");
static_assert(offsetof(ABP_HeroLoadout_C, DirectionalLight_LowDetailMode) == 0x000278, "Member 'ABP_HeroLoadout_C::DirectionalLight_LowDetailMode' has a wrong offset!");
static_assert(offsetof(ABP_HeroLoadout_C, ParticleSystems) == 0x000280, "Member 'ABP_HeroLoadout_C::ParticleSystems' has a wrong offset!");
static_assert(offsetof(ABP_HeroLoadout_C, IsActive) == 0x000290, "Member 'ABP_HeroLoadout_C::IsActive' has a wrong offset!");
static_assert(offsetof(ABP_HeroLoadout_C, DebugLOWQualityLighting) == 0x000291, "Member 'ABP_HeroLoadout_C::DebugLOWQualityLighting' has a wrong offset!");
static_assert(offsetof(ABP_HeroLoadout_C, SkyLight_LowDetailMode) == 0x000298, "Member 'ABP_HeroLoadout_C::SkyLight_LowDetailMode' has a wrong offset!");
static_assert(offsetof(ABP_HeroLoadout_C, ExponentialHeightfog_LowDetailMode) == 0x0002A0, "Member 'ABP_HeroLoadout_C::ExponentialHeightfog_LowDetailMode' has a wrong offset!");

}

