#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Hex_PARENT

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function BP_Hex_PARENT.BP_Hex_PARENT_C.UpdateFromFrontendCamera
// 0x0007 (0x0007 - 0x0000)
struct BP_Hex_PARENT_C_UpdateFromFrontendCamera final
{
public:
	EFrontEndCamera                               CameraMode;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Hex_PARENT_C_UpdateFromFrontendCamera) == 0x000001, "Wrong alignment on BP_Hex_PARENT_C_UpdateFromFrontendCamera");
static_assert(sizeof(BP_Hex_PARENT_C_UpdateFromFrontendCamera) == 0x000007, "Wrong size on BP_Hex_PARENT_C_UpdateFromFrontendCamera");
static_assert(offsetof(BP_Hex_PARENT_C_UpdateFromFrontendCamera, CameraMode) == 0x000000, "Member 'BP_Hex_PARENT_C_UpdateFromFrontendCamera::CameraMode' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_UpdateFromFrontendCamera, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'BP_Hex_PARENT_C_UpdateFromFrontendCamera::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_UpdateFromFrontendCamera, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000002, "Member 'BP_Hex_PARENT_C_UpdateFromFrontendCamera::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_UpdateFromFrontendCamera, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000003, "Member 'BP_Hex_PARENT_C_UpdateFromFrontendCamera::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_UpdateFromFrontendCamera, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000004, "Member 'BP_Hex_PARENT_C_UpdateFromFrontendCamera::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_UpdateFromFrontendCamera, CallFunc_BooleanOR_ReturnValue) == 0x000005, "Member 'BP_Hex_PARENT_C_UpdateFromFrontendCamera::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_UpdateFromFrontendCamera, CallFunc_BooleanOR_ReturnValue_1) == 0x000006, "Member 'BP_Hex_PARENT_C_UpdateFromFrontendCamera::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function BP_Hex_PARENT.BP_Hex_PARENT_C.HasPinnedQuest
// 0x0001 (0x0001 - 0x0000)
struct BP_Hex_PARENT_C_HasPinnedQuest final
{
public:
	bool                                          Pinned;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Hex_PARENT_C_HasPinnedQuest) == 0x000001, "Wrong alignment on BP_Hex_PARENT_C_HasPinnedQuest");
static_assert(sizeof(BP_Hex_PARENT_C_HasPinnedQuest) == 0x000001, "Wrong size on BP_Hex_PARENT_C_HasPinnedQuest");
static_assert(offsetof(BP_Hex_PARENT_C_HasPinnedQuest, Pinned) == 0x000000, "Member 'BP_Hex_PARENT_C_HasPinnedQuest::Pinned' has a wrong offset!");

// Function BP_Hex_PARENT.BP_Hex_PARENT_C.HandleUpdatingBannerMesh
// 0x0098 (0x0098 - 0x0000)
struct BP_Hex_PARENT_C_HandleUpdatingBannerMesh final
{
public:
	class USceneComponent*                        Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               CompletedQuest;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Material_Instance_Dynamic;                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       UniqueId;                                          // 0x0018(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          HasCompletedQuest;                                 // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidNetID_ReturnValue;                 // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetGameAccountId_ReturnValue;             // 0x0068(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_HasCompletedQuest_ReturnValue;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Hex_PARENT_C_HandleUpdatingBannerMesh) == 0x000008, "Wrong alignment on BP_Hex_PARENT_C_HandleUpdatingBannerMesh");
static_assert(sizeof(BP_Hex_PARENT_C_HandleUpdatingBannerMesh) == 0x000098, "Wrong size on BP_Hex_PARENT_C_HandleUpdatingBannerMesh");
static_assert(offsetof(BP_Hex_PARENT_C_HandleUpdatingBannerMesh, Target) == 0x000000, "Member 'BP_Hex_PARENT_C_HandleUpdatingBannerMesh::Target' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleUpdatingBannerMesh, CompletedQuest) == 0x000008, "Member 'BP_Hex_PARENT_C_HandleUpdatingBannerMesh::CompletedQuest' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleUpdatingBannerMesh, Material_Instance_Dynamic) == 0x000010, "Member 'BP_Hex_PARENT_C_HandleUpdatingBannerMesh::Material_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleUpdatingBannerMesh, UniqueId) == 0x000018, "Member 'BP_Hex_PARENT_C_HandleUpdatingBannerMesh::UniqueId' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleUpdatingBannerMesh, HasCompletedQuest) == 0x000040, "Member 'BP_Hex_PARENT_C_HandleUpdatingBannerMesh::HasCompletedQuest' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleUpdatingBannerMesh, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000041, "Member 'BP_Hex_PARENT_C_HandleUpdatingBannerMesh::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleUpdatingBannerMesh, CallFunc_NotEqual_ObjectObject_ReturnValue_1) == 0x000042, "Member 'BP_Hex_PARENT_C_HandleUpdatingBannerMesh::CallFunc_NotEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleUpdatingBannerMesh, CallFunc_BooleanAND_ReturnValue) == 0x000043, "Member 'BP_Hex_PARENT_C_HandleUpdatingBannerMesh::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleUpdatingBannerMesh, CallFunc_IsValidNetID_ReturnValue) == 0x000044, "Member 'BP_Hex_PARENT_C_HandleUpdatingBannerMesh::CallFunc_IsValidNetID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleUpdatingBannerMesh, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x000048, "Member 'BP_Hex_PARENT_C_HandleUpdatingBannerMesh::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleUpdatingBannerMesh, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_Hex_PARENT_C_HandleUpdatingBannerMesh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleUpdatingBannerMesh, CallFunc_GetQuestManager_ReturnValue) == 0x000060, "Member 'BP_Hex_PARENT_C_HandleUpdatingBannerMesh::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleUpdatingBannerMesh, CallFunc_GetGameAccountId_ReturnValue) == 0x000068, "Member 'BP_Hex_PARENT_C_HandleUpdatingBannerMesh::CallFunc_GetGameAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleUpdatingBannerMesh, CallFunc_HasCompletedQuest_ReturnValue) == 0x000090, "Member 'BP_Hex_PARENT_C_HandleUpdatingBannerMesh::CallFunc_HasCompletedQuest_ReturnValue' has a wrong offset!");

// Function BP_Hex_PARENT.BP_Hex_PARENT_C.HandleMissionAlert
// 0x0198 (0x0198 - 0x0000)
struct BP_Hex_PARENT_C_HandleMissionAlert final
{
public:
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue;         // 0x0000(0x0048)()
	struct FGameplayTagContainer                  CallFunc_GetMissionAlertVisualTags_ReturnValue;    // 0x0048(0x0020)()
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue_1;       // 0x0068(0x0048)()
	bool                                          CallFunc_DoesContainerMatchTagQuery_ReturnValue;   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetMissionAlertVisualTags_ReturnValue_1;  // 0x00B8(0x0020)()
	bool                                          CallFunc_DoesContainerMatchTagQuery_ReturnValue_1; // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetMissionAlertVisualTags_ReturnValue_2;  // 0x00E0(0x0020)()
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue_2;       // 0x0100(0x0048)()
	struct FGameplayTagContainer                  CallFunc_GetMissionAlertVisualTags_ReturnValue_3;  // 0x0148(0x0020)()
	bool                                          CallFunc_DoesContainerMatchTagQuery_ReturnValue_2; // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTileMissionAlertRewardClaimed_ReturnValue; // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionAlertIndicator_C*               K2Node_DynamicCast_AsMission_Alert_Indicator;      // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTileHidden_ReturnValue;                 // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMissionAlertTile_ReturnValue;           // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0193(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Hex_PARENT_C_HandleMissionAlert) == 0x000008, "Wrong alignment on BP_Hex_PARENT_C_HandleMissionAlert");
static_assert(sizeof(BP_Hex_PARENT_C_HandleMissionAlert) == 0x000198, "Wrong size on BP_Hex_PARENT_C_HandleMissionAlert");
static_assert(offsetof(BP_Hex_PARENT_C_HandleMissionAlert, CallFunc_MakeGameplayTagQuery_ReturnValue) == 0x000000, "Member 'BP_Hex_PARENT_C_HandleMissionAlert::CallFunc_MakeGameplayTagQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleMissionAlert, CallFunc_GetMissionAlertVisualTags_ReturnValue) == 0x000048, "Member 'BP_Hex_PARENT_C_HandleMissionAlert::CallFunc_GetMissionAlertVisualTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleMissionAlert, CallFunc_MakeGameplayTagQuery_ReturnValue_1) == 0x000068, "Member 'BP_Hex_PARENT_C_HandleMissionAlert::CallFunc_MakeGameplayTagQuery_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleMissionAlert, CallFunc_DoesContainerMatchTagQuery_ReturnValue) == 0x0000B0, "Member 'BP_Hex_PARENT_C_HandleMissionAlert::CallFunc_DoesContainerMatchTagQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleMissionAlert, CallFunc_GetMissionAlertVisualTags_ReturnValue_1) == 0x0000B8, "Member 'BP_Hex_PARENT_C_HandleMissionAlert::CallFunc_GetMissionAlertVisualTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleMissionAlert, CallFunc_DoesContainerMatchTagQuery_ReturnValue_1) == 0x0000D8, "Member 'BP_Hex_PARENT_C_HandleMissionAlert::CallFunc_DoesContainerMatchTagQuery_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleMissionAlert, CallFunc_GetMissionAlertVisualTags_ReturnValue_2) == 0x0000E0, "Member 'BP_Hex_PARENT_C_HandleMissionAlert::CallFunc_GetMissionAlertVisualTags_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleMissionAlert, CallFunc_MakeGameplayTagQuery_ReturnValue_2) == 0x000100, "Member 'BP_Hex_PARENT_C_HandleMissionAlert::CallFunc_MakeGameplayTagQuery_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleMissionAlert, CallFunc_GetMissionAlertVisualTags_ReturnValue_3) == 0x000148, "Member 'BP_Hex_PARENT_C_HandleMissionAlert::CallFunc_GetMissionAlertVisualTags_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleMissionAlert, CallFunc_DoesContainerMatchTagQuery_ReturnValue_2) == 0x000168, "Member 'BP_Hex_PARENT_C_HandleMissionAlert::CallFunc_DoesContainerMatchTagQuery_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleMissionAlert, CallFunc_BooleanOR_ReturnValue) == 0x000169, "Member 'BP_Hex_PARENT_C_HandleMissionAlert::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleMissionAlert, CallFunc_GetContext_ReturnValue) == 0x000170, "Member 'BP_Hex_PARENT_C_HandleMissionAlert::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleMissionAlert, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000178, "Member 'BP_Hex_PARENT_C_HandleMissionAlert::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleMissionAlert, CallFunc_IsTileMissionAlertRewardClaimed_ReturnValue) == 0x000180, "Member 'BP_Hex_PARENT_C_HandleMissionAlert::CallFunc_IsTileMissionAlertRewardClaimed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleMissionAlert, K2Node_DynamicCast_AsMission_Alert_Indicator) == 0x000188, "Member 'BP_Hex_PARENT_C_HandleMissionAlert::K2Node_DynamicCast_AsMission_Alert_Indicator' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleMissionAlert, K2Node_DynamicCast_bSuccess) == 0x000190, "Member 'BP_Hex_PARENT_C_HandleMissionAlert::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleMissionAlert, CallFunc_IsTileHidden_ReturnValue) == 0x000191, "Member 'BP_Hex_PARENT_C_HandleMissionAlert::CallFunc_IsTileHidden_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleMissionAlert, CallFunc_IsMissionAlertTile_ReturnValue) == 0x000192, "Member 'BP_Hex_PARENT_C_HandleMissionAlert::CallFunc_IsMissionAlertTile_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleMissionAlert, CallFunc_Not_PreBool_ReturnValue) == 0x000193, "Member 'BP_Hex_PARENT_C_HandleMissionAlert::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleMissionAlert, CallFunc_BooleanAND_ReturnValue) == 0x000194, "Member 'BP_Hex_PARENT_C_HandleMissionAlert::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_Hex_PARENT.BP_Hex_PARENT_C.GroundSliceSettings
// 0x0030 (0x0030 - 0x0000)
struct BP_Hex_PARENT_C_GroundSliceSettings final
{
public:
	class UMaterialInstanceDynamic*               SourceMaterial;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             TileTypeA;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             TileTypeB;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TileIsSameRegionA;                                 // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TileIsSameRegionB;                                 // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TileIsHiddenA;                                     // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TileIsHiddenB;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TileExistsA;                                       // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TileExistsB;                                       // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hex_PARENT_C_GroundSliceSettings) == 0x000008, "Wrong alignment on BP_Hex_PARENT_C_GroundSliceSettings");
static_assert(sizeof(BP_Hex_PARENT_C_GroundSliceSettings) == 0x000030, "Wrong size on BP_Hex_PARENT_C_GroundSliceSettings");
static_assert(offsetof(BP_Hex_PARENT_C_GroundSliceSettings, SourceMaterial) == 0x000000, "Member 'BP_Hex_PARENT_C_GroundSliceSettings::SourceMaterial' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_GroundSliceSettings, TileTypeA) == 0x000008, "Member 'BP_Hex_PARENT_C_GroundSliceSettings::TileTypeA' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_GroundSliceSettings, TileTypeB) == 0x000010, "Member 'BP_Hex_PARENT_C_GroundSliceSettings::TileTypeB' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_GroundSliceSettings, TileIsSameRegionA) == 0x000018, "Member 'BP_Hex_PARENT_C_GroundSliceSettings::TileIsSameRegionA' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_GroundSliceSettings, TileIsSameRegionB) == 0x00001C, "Member 'BP_Hex_PARENT_C_GroundSliceSettings::TileIsSameRegionB' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_GroundSliceSettings, TileIsHiddenA) == 0x000020, "Member 'BP_Hex_PARENT_C_GroundSliceSettings::TileIsHiddenA' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_GroundSliceSettings, TileIsHiddenB) == 0x000024, "Member 'BP_Hex_PARENT_C_GroundSliceSettings::TileIsHiddenB' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_GroundSliceSettings, TileExistsA) == 0x000028, "Member 'BP_Hex_PARENT_C_GroundSliceSettings::TileExistsA' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_GroundSliceSettings, TileExistsB) == 0x00002C, "Member 'BP_Hex_PARENT_C_GroundSliceSettings::TileExistsB' has a wrong offset!");

// Function BP_Hex_PARENT.BP_Hex_PARENT_C.UserConstructionScript
// 0x0070 (0x0070 - 0x0000)
struct BP_Hex_PARENT_C_UserConstructionScript final
{
public:
	struct FTransform                             Temp_struct_Variable;                              // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hex_PARENT_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_Hex_PARENT_C_UserConstructionScript");
static_assert(sizeof(BP_Hex_PARENT_C_UserConstructionScript) == 0x000070, "Wrong size on BP_Hex_PARENT_C_UserConstructionScript");
static_assert(offsetof(BP_Hex_PARENT_C_UserConstructionScript, Temp_struct_Variable) == 0x000000, "Member 'BP_Hex_PARENT_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000030, "Member 'BP_Hex_PARENT_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000038, "Member 'BP_Hex_PARENT_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000040, "Member 'BP_Hex_PARENT_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_Hex_PARENT_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000050, "Member 'BP_Hex_PARENT_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'BP_Hex_PARENT_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_UserConstructionScript, CallFunc_Array_LastIndex_ReturnValue) == 0x000058, "Member 'BP_Hex_PARENT_C_UserConstructionScript::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_UserConstructionScript, CallFunc_Greater_IntInt_ReturnValue) == 0x00005C, "Member 'BP_Hex_PARENT_C_UserConstructionScript::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_UserConstructionScript, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000060, "Member 'BP_Hex_PARENT_C_UserConstructionScript::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");

// Function BP_Hex_PARENT.BP_Hex_PARENT_C.OnLoaded_192496DB41CC2100CC1C729DB594CEF8
// 0x0008 (0x0008 - 0x0000)
struct BP_Hex_PARENT_C_OnLoaded_192496DB41CC2100CC1C729DB594CEF8 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hex_PARENT_C_OnLoaded_192496DB41CC2100CC1C729DB594CEF8) == 0x000008, "Wrong alignment on BP_Hex_PARENT_C_OnLoaded_192496DB41CC2100CC1C729DB594CEF8");
static_assert(sizeof(BP_Hex_PARENT_C_OnLoaded_192496DB41CC2100CC1C729DB594CEF8) == 0x000008, "Wrong size on BP_Hex_PARENT_C_OnLoaded_192496DB41CC2100CC1C729DB594CEF8");
static_assert(offsetof(BP_Hex_PARENT_C_OnLoaded_192496DB41CC2100CC1C729DB594CEF8, Loaded) == 0x000000, "Member 'BP_Hex_PARENT_C_OnLoaded_192496DB41CC2100CC1C729DB594CEF8::Loaded' has a wrong offset!");

// Function BP_Hex_PARENT.BP_Hex_PARENT_C.HandleTeamPowerChanged
// 0x0008 (0x0008 - 0x0000)
struct BP_Hex_PARENT_C_HandleTeamPowerChanged final
{
public:
	int32                                         TeamPower;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PersonalPower;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hex_PARENT_C_HandleTeamPowerChanged) == 0x000004, "Wrong alignment on BP_Hex_PARENT_C_HandleTeamPowerChanged");
static_assert(sizeof(BP_Hex_PARENT_C_HandleTeamPowerChanged) == 0x000008, "Wrong size on BP_Hex_PARENT_C_HandleTeamPowerChanged");
static_assert(offsetof(BP_Hex_PARENT_C_HandleTeamPowerChanged, TeamPower) == 0x000000, "Member 'BP_Hex_PARENT_C_HandleTeamPowerChanged::TeamPower' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleTeamPowerChanged, PersonalPower) == 0x000004, "Member 'BP_Hex_PARENT_C_HandleTeamPowerChanged::PersonalPower' has a wrong offset!");

// Function BP_Hex_PARENT.BP_Hex_PARENT_C.HandleFrontendCameraChanged
// 0x0002 (0x0002 - 0x0000)
struct BP_Hex_PARENT_C_HandleFrontendCameraChanged final
{
public:
	EFrontEndCamera                               NewCamera;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               OldCamera;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hex_PARENT_C_HandleFrontendCameraChanged) == 0x000001, "Wrong alignment on BP_Hex_PARENT_C_HandleFrontendCameraChanged");
static_assert(sizeof(BP_Hex_PARENT_C_HandleFrontendCameraChanged) == 0x000002, "Wrong size on BP_Hex_PARENT_C_HandleFrontendCameraChanged");
static_assert(offsetof(BP_Hex_PARENT_C_HandleFrontendCameraChanged, NewCamera) == 0x000000, "Member 'BP_Hex_PARENT_C_HandleFrontendCameraChanged::NewCamera' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleFrontendCameraChanged, OldCamera) == 0x000001, "Member 'BP_Hex_PARENT_C_HandleFrontendCameraChanged::OldCamera' has a wrong offset!");

// Function BP_Hex_PARENT.BP_Hex_PARENT_C.MissionLightning
// 0x0024 (0x0024 - 0x0000)
struct BP_Hex_PARENT_C_MissionLightning final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmitterTime;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Velocity;                                          // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hex_PARENT_C_MissionLightning) == 0x000004, "Wrong alignment on BP_Hex_PARENT_C_MissionLightning");
static_assert(sizeof(BP_Hex_PARENT_C_MissionLightning) == 0x000024, "Wrong size on BP_Hex_PARENT_C_MissionLightning");
static_assert(offsetof(BP_Hex_PARENT_C_MissionLightning, EventName) == 0x000000, "Member 'BP_Hex_PARENT_C_MissionLightning::EventName' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_MissionLightning, EmitterTime) == 0x000008, "Member 'BP_Hex_PARENT_C_MissionLightning::EmitterTime' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_MissionLightning, Location) == 0x00000C, "Member 'BP_Hex_PARENT_C_MissionLightning::Location' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_MissionLightning, Velocity) == 0x000018, "Member 'BP_Hex_PARENT_C_MissionLightning::Velocity' has a wrong offset!");

// Function BP_Hex_PARENT.BP_Hex_PARENT_C.MissionLightningOff
// 0x0034 (0x0034 - 0x0000)
struct BP_Hex_PARENT_C_MissionLightningOff final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmitterTime;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ParticleTime;                                      // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Velocity;                                          // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Direction;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hex_PARENT_C_MissionLightningOff) == 0x000004, "Wrong alignment on BP_Hex_PARENT_C_MissionLightningOff");
static_assert(sizeof(BP_Hex_PARENT_C_MissionLightningOff) == 0x000034, "Wrong size on BP_Hex_PARENT_C_MissionLightningOff");
static_assert(offsetof(BP_Hex_PARENT_C_MissionLightningOff, EventName) == 0x000000, "Member 'BP_Hex_PARENT_C_MissionLightningOff::EventName' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_MissionLightningOff, EmitterTime) == 0x000008, "Member 'BP_Hex_PARENT_C_MissionLightningOff::EmitterTime' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_MissionLightningOff, ParticleTime) == 0x00000C, "Member 'BP_Hex_PARENT_C_MissionLightningOff::ParticleTime' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_MissionLightningOff, Location) == 0x000010, "Member 'BP_Hex_PARENT_C_MissionLightningOff::Location' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_MissionLightningOff, Velocity) == 0x00001C, "Member 'BP_Hex_PARENT_C_MissionLightningOff::Velocity' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_MissionLightningOff, Direction) == 0x000028, "Member 'BP_Hex_PARENT_C_MissionLightningOff::Direction' has a wrong offset!");

// Function BP_Hex_PARENT.BP_Hex_PARENT_C.AsyncUpdateBanner
// 0x0030 (0x0030 - 0x0000)
struct BP_Hex_PARENT_C_AsyncUpdateBanner final
{
public:
	class UMaterialInstanceDynamic*               Material_Instance_Dynamic;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       Unique_Net_Id;                                     // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hex_PARENT_C_AsyncUpdateBanner) == 0x000008, "Wrong alignment on BP_Hex_PARENT_C_AsyncUpdateBanner");
static_assert(sizeof(BP_Hex_PARENT_C_AsyncUpdateBanner) == 0x000030, "Wrong size on BP_Hex_PARENT_C_AsyncUpdateBanner");
static_assert(offsetof(BP_Hex_PARENT_C_AsyncUpdateBanner, Material_Instance_Dynamic) == 0x000000, "Member 'BP_Hex_PARENT_C_AsyncUpdateBanner::Material_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_AsyncUpdateBanner, Unique_Net_Id) == 0x000008, "Member 'BP_Hex_PARENT_C_AsyncUpdateBanner::Unique_Net_Id' has a wrong offset!");

// Function BP_Hex_PARENT.BP_Hex_PARENT_C.ExecuteUbergraph_BP_Hex_PARENT
// 0x0648 (0x0648 - 0x0000)
struct BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_TeamPower;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PersonalPower;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTilePlayable_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               K2Node_CustomEvent_NewCamera;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               K2Node_CustomEvent_OldCamera;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItem*                         CallFunc_IsTileValidForMarkedQuest_OutMarkedQuest; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTileValidForMarkedQuest_ReturnValue;    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasValidMissionData_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATheaterCamera_Blueprint_C*>     CallFunc_GetAllActorsOfClass_OutActors;            // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTileHidden_ReturnValue;                 // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTileLocked_ReturnValue;                 // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue_1;                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortPublicAccountInfo                 CallFunc_GetCurrentlyViewedAccountInfo_Result;     // 0x00A8(0x0034)(NoDestructor)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DF[0x1];                                       // 0x00DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue_2;                 // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue_1;        // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, float EmitterTime, int32 ParticleTime, const struct FVector& Location, const struct FVector& Velocity, const struct FVector& Direction)> K2Node_CreateDelegate_OutputDelegate;              // 0x00EC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, float EmitterTime, const struct FVector& Location, const struct FVector& Velocity)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue_3;                 // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATheaterCamera_Blueprint_C*             CallFunc_Array_Get_Item;                           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Temp_object_Variable_1;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Temp_object_Variable_2;                            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Get_Conning_Color_For_Specific_Difficulty_Difficulty_Linear_Color; // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Conning_Color_For_Specific_Difficulty_Invalid; // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue_4;                 // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               K2Node_Select_Default;                             // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortMissionDetails                    CallFunc_GetTileMissionDetails_MissionDetails;     // 0x0180(0x0168)()
	bool                                          CallFunc_GetTileMissionDetails_ReturnValue;        // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Get_Conning_Color_From_Difficulty_Value_Difficulty_Linear_Color; // 0x02F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Conning_Color_From_Difficulty_Value_Success; // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Get_Conning_Color_From_Difficulty_Value_TooltipText; // 0x0308(0x0018)()
	int32                                         CallFunc_Get_Conning_Color_From_Difficulty_Value_DifficultyValue; // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFrontEndCamera NewCamera, EFrontEndCamera OldCamera)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0324(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue_5;                 // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               CallFunc_GetFrontEndCamera_ReturnValue;            // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 TeamPower, int32 PersonalPower)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0350(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_EventName_1;                    // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_EmitterTime_1;                  // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location_1;                     // 0x036C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Velocity_1;                     // 0x0378(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0384(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_EmitterTime;                    // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ParticleTime;                   // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0394(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Velocity;                       // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Direction;                      // 0x03AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_6;                 // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue_7;                 // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortMissionDetails                    CallFunc_GetTileMissionDetails_MissionDetails_1;   // 0x03D0(0x0168)()
	bool                                          CallFunc_GetTileMissionDetails_ReturnValue_1;      // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               K2Node_CustomEvent_Material_Instance_Dynamic;      // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_Unique_Net_Id;                  // 0x0548(0x0028)(HasGetValueTypeHash)
	struct FFortHomeBaseInfo                      CallFunc_GetHomeBaseInfoForPlayer_Result;          // 0x0570(0x0040)()
	class UTexture*                               K2Node_DynamicCast_AsTexture;                      // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B9[0x3];                                      // 0x05B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x05BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x05C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetBannerColorPrimaryColorFromRowName_ReturnValue; // 0x05CC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DC[0x4];                                      // 0x05DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetBannerLargeIconAssetFromRowName_ReturnValue; // 0x05E0(0x0028)(HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetBannerColorSecondaryColorFromRowName_ReturnValue; // 0x0608(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_619[0x3];                                      // 0x0619(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x061C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsTeamRatingDataValid_ReturnValue;        // 0x062C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62D[0x3];                                      // 0x062D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x0630(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0638(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0644(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT) == 0x000008, "Wrong alignment on BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT");
static_assert(sizeof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT) == 0x000648, "Wrong size on BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, EntryPoint) == 0x000000, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
