#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bunker_Man_1h_Axe_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Bunker_Man_1h_Axe_AnimBP.Bunker_Man_1h_Axe_AnimBP_C
// 0x05D8 (0x0840 - 0x0268)
class UBunker_Man_1h_Axe_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_6E43C361416B401CE03952BEE67316D4; // 0x0278(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_415B4F71451D4B7D24387CBC763C2954; // 0x0298(0x0018)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_DDB7BA7E4B30010F7ABC448D1E8C5269; // 0x02B0(0x0550)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_BED935E247CC763212C0BC94576DDCF6; // 0x0800(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_A1806E1A4079DDFDC3E9618896D7452A; // 0x0820(0x0020)()

public:
	void ExecuteUbergraph_Bunker_Man_1h_Axe_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bunker_Man_1h_Axe_AnimBP_C">();
	}
	static class UBunker_Man_1h_Axe_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBunker_Man_1h_Axe_AnimBP_C>();
	}
};
static_assert(alignof(UBunker_Man_1h_Axe_AnimBP_C) == 0x000010, "Wrong alignment on UBunker_Man_1h_Axe_AnimBP_C");
static_assert(sizeof(UBunker_Man_1h_Axe_AnimBP_C) == 0x000840, "Wrong size on UBunker_Man_1h_Axe_AnimBP_C");
static_assert(offsetof(UBunker_Man_1h_Axe_AnimBP_C, UberGraphFrame) == 0x000270, "Member 'UBunker_Man_1h_Axe_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBunker_Man_1h_Axe_AnimBP_C, AnimGraphNode_Root_6E43C361416B401CE03952BEE67316D4) == 0x000278, "Member 'UBunker_Man_1h_Axe_AnimBP_C::AnimGraphNode_Root_6E43C361416B401CE03952BEE67316D4' has a wrong offset!");
static_assert(offsetof(UBunker_Man_1h_Axe_AnimBP_C, AnimGraphNode_LocalRefPose_415B4F71451D4B7D24387CBC763C2954) == 0x000298, "Member 'UBunker_Man_1h_Axe_AnimBP_C::AnimGraphNode_LocalRefPose_415B4F71451D4B7D24387CBC763C2954' has a wrong offset!");
static_assert(offsetof(UBunker_Man_1h_Axe_AnimBP_C, AnimGraphNode_RigidBody_DDB7BA7E4B30010F7ABC448D1E8C5269) == 0x0002B0, "Member 'UBunker_Man_1h_Axe_AnimBP_C::AnimGraphNode_RigidBody_DDB7BA7E4B30010F7ABC448D1E8C5269' has a wrong offset!");
static_assert(offsetof(UBunker_Man_1h_Axe_AnimBP_C, AnimGraphNode_LocalToComponentSpace_BED935E247CC763212C0BC94576DDCF6) == 0x000800, "Member 'UBunker_Man_1h_Axe_AnimBP_C::AnimGraphNode_LocalToComponentSpace_BED935E247CC763212C0BC94576DDCF6' has a wrong offset!");
static_assert(offsetof(UBunker_Man_1h_Axe_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_A1806E1A4079DDFDC3E9618896D7452A) == 0x000820, "Member 'UBunker_Man_1h_Axe_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_A1806E1A4079DDFDC3E9618896D7452A' has a wrong offset!");

}

