#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraAnimationTransition

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CameraAnimationTransition.CameraAnimationTransition_C
// 0x00B0 (0x02F0 - 0x0240)
class ACameraAnimationTransition_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_2750533A46B9AEF2BE294F8153FE4FD4; // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_2750533A46B9AEF2BE294F8153FE4FD4; // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortnitePartyBackdrop_Camera_C*        CameraBR;                                          // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CameraLocationBR;                                  // 0x0270(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AFortnitePartyBackdrop_Camera_C*        CameraBR16Player;                                  // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortnitePartyBackdrop_Camera_C*        CameraCreative;                                    // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortnitePartyBackdrop_Camera_C*        CameraCreative16Player;                            // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CameraLocationCreative;                            // 0x02C0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void UserConstructionScript();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void MoveCameraUp();
	void MoveCameraDown();
	void ExecuteUbergraph_CameraAnimationTransition(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CameraAnimationTransition_C">();
	}
	static class ACameraAnimationTransition_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACameraAnimationTransition_C>();
	}
};
static_assert(alignof(ACameraAnimationTransition_C) == 0x000010, "Wrong alignment on ACameraAnimationTransition_C");
static_assert(sizeof(ACameraAnimationTransition_C) == 0x0002F0, "Wrong size on ACameraAnimationTransition_C");
static_assert(offsetof(ACameraAnimationTransition_C, UberGraphFrame) == 0x000240, "Member 'ACameraAnimationTransition_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACameraAnimationTransition_C, DefaultSceneRoot) == 0x000248, "Member 'ACameraAnimationTransition_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ACameraAnimationTransition_C, Timeline_0_NewTrack_0_2750533A46B9AEF2BE294F8153FE4FD4) == 0x000250, "Member 'ACameraAnimationTransition_C::Timeline_0_NewTrack_0_2750533A46B9AEF2BE294F8153FE4FD4' has a wrong offset!");
static_assert(offsetof(ACameraAnimationTransition_C, Timeline_0__Direction_2750533A46B9AEF2BE294F8153FE4FD4) == 0x000254, "Member 'ACameraAnimationTransition_C::Timeline_0__Direction_2750533A46B9AEF2BE294F8153FE4FD4' has a wrong offset!");
static_assert(offsetof(ACameraAnimationTransition_C, Timeline_0) == 0x000258, "Member 'ACameraAnimationTransition_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ACameraAnimationTransition_C, CameraBR) == 0x000260, "Member 'ACameraAnimationTransition_C::CameraBR' has a wrong offset!");
static_assert(offsetof(ACameraAnimationTransition_C, CameraLocationBR) == 0x000270, "Member 'ACameraAnimationTransition_C::CameraLocationBR' has a wrong offset!");
static_assert(offsetof(ACameraAnimationTransition_C, CameraBR16Player) == 0x0002A0, "Member 'ACameraAnimationTransition_C::CameraBR16Player' has a wrong offset!");
static_assert(offsetof(ACameraAnimationTransition_C, CameraCreative) == 0x0002A8, "Member 'ACameraAnimationTransition_C::CameraCreative' has a wrong offset!");
static_assert(offsetof(ACameraAnimationTransition_C, CameraCreative16Player) == 0x0002B0, "Member 'ACameraAnimationTransition_C::CameraCreative16Player' has a wrong offset!");
static_assert(offsetof(ACameraAnimationTransition_C, CameraLocationCreative) == 0x0002C0, "Member 'ACameraAnimationTransition_C::CameraLocationCreative' has a wrong offset!");

}

