#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CheckFrontEndRewardsAction

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "FrontEndRewards_Definition_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CheckFrontEndRewardsAction.CheckFrontEndRewardsAction_C
// 0x0078 (0x0318 - 0x02A0)
class ACheckFrontEndRewardsAction_C final : public AFortScriptedAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FFrontEndRewards_Definition            RewardsDefinition;                                 // 0x02B0(0x0060)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          ShowRewardsWidget;                                 // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void Clear();
	void HandleRewardsClaimed(class UFrontEndRewards_Widget_C* RewardsWidget);
	void PopulateCollectionBookRewards();
	void PopulateRewards();
	void OpenFrontEndRewards();
	void PopulateUnseenQuests(EFortQuestType QuestType);
	void GetCompletedQuests(TArray<class UFortQuestItem*>* Completed_Quests);
	void PopulateNewQuests();
	void PopulateQuestRewards();
	void PopulateMissionRewards();
	void CompleteRewardsAction();
	void Execute(const struct FFortScriptedActionParams& Params_0);
	void ExecuteUbergraph_CheckFrontEndRewardsAction(int32 EntryPoint);
	void HandleRewardsClaimError(class UFrontEndRewards_Widget_C* RewardsWidget);
	void PopulateMissionAlertRewards();
	void Is_FrontEndRewards_Running(bool* bRunning);
	bool CanShowFrontendRewards();
	void HandleRewardsIgnored(class UFrontEndRewards_Widget_C* RewardsWidget);
	void PopulateDifficultyIncreaseRewards();
	void PopulateNewGiftBoxes();
	void PopulateItemCacheRewards();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CheckFrontEndRewardsAction_C">();
	}
	static class ACheckFrontEndRewardsAction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACheckFrontEndRewardsAction_C>();
	}
};
static_assert(alignof(ACheckFrontEndRewardsAction_C) == 0x000008, "Wrong alignment on ACheckFrontEndRewardsAction_C");
static_assert(sizeof(ACheckFrontEndRewardsAction_C) == 0x000318, "Wrong size on ACheckFrontEndRewardsAction_C");
static_assert(offsetof(ACheckFrontEndRewardsAction_C, UberGraphFrame) == 0x0002A0, "Member 'ACheckFrontEndRewardsAction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACheckFrontEndRewardsAction_C, DefaultSceneRoot) == 0x0002A8, "Member 'ACheckFrontEndRewardsAction_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ACheckFrontEndRewardsAction_C, RewardsDefinition) == 0x0002B0, "Member 'ACheckFrontEndRewardsAction_C::RewardsDefinition' has a wrong offset!");
static_assert(offsetof(ACheckFrontEndRewardsAction_C, ShowRewardsWidget) == 0x000310, "Member 'ACheckFrontEndRewardsAction_C::ShowRewardsWidget' has a wrong offset!");

}

