#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommandRoomItemPedestal

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CommandRoomItemPedestal.CommandRoomItemPedestal_C
// 0x0058 (0x0378 - 0x0320)
class ACommandRoomItemPedestal_C final : public AFortCommandRoomPedestal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagQuery                      Animation_Tag_Query_Idle;                          // 0x0330(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_CommandRoomItemPedestal(int32 EntryPoint);
	void OnHeroPawnSetupCompleted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CommandRoomItemPedestal_C">();
	}
	static class ACommandRoomItemPedestal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACommandRoomItemPedestal_C>();
	}
};
static_assert(alignof(ACommandRoomItemPedestal_C) == 0x000008, "Wrong alignment on ACommandRoomItemPedestal_C");
static_assert(sizeof(ACommandRoomItemPedestal_C) == 0x000378, "Wrong size on ACommandRoomItemPedestal_C");
static_assert(offsetof(ACommandRoomItemPedestal_C, UberGraphFrame) == 0x000320, "Member 'ACommandRoomItemPedestal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACommandRoomItemPedestal_C, Arrow) == 0x000328, "Member 'ACommandRoomItemPedestal_C::Arrow' has a wrong offset!");
static_assert(offsetof(ACommandRoomItemPedestal_C, Animation_Tag_Query_Idle) == 0x000330, "Member 'ACommandRoomItemPedestal_C::Animation_Tag_Query_Idle' has a wrong offset!");

}

