#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DailyRewardsEpic

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DailyRewardsEpic.DailyRewardsEpic_C.ExecuteUbergraph_DailyRewardsEpic
// 0x0110 (0x0110 - 0x0000)
struct DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0058(0x0018)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   CallFunc_GetRarity_ReturnValue;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x0080(0x0080)()
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_103[0x1];                                      // 0x0103(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   Temp_byte_Variable_8;                              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic) == 0x000008, "Wrong alignment on DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic");
static_assert(sizeof(DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic) == 0x000110, "Wrong size on DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic");
static_assert(offsetof(DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic, EntryPoint) == 0x000000, "Member 'DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic::EntryPoint' has a wrong offset!");
static_assert(offsetof(DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic, Temp_byte_Variable) == 0x000004, "Member 'DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic, Temp_byte_Variable_1) == 0x000005, "Member 'DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic, Temp_byte_Variable_2) == 0x000006, "Member 'DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic, Temp_byte_Variable_3) == 0x000007, "Member 'DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic, K2Node_MakeArray_Array) == 0x000048, "Member 'DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic, CallFunc_Format_ReturnValue) == 0x000058, "Member 'DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000070, "Member 'DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic, Temp_byte_Variable_4) == 0x000078, "Member 'DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic, CallFunc_GetRarity_ReturnValue) == 0x000079, "Member 'DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic, CallFunc_BPGetRarityData_ReturnValue) == 0x000080, "Member 'DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic, Temp_byte_Variable_5) == 0x000100, "Member 'DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic, Temp_byte_Variable_6) == 0x000101, "Member 'DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic, Temp_byte_Variable_7) == 0x000102, "Member 'DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic, CallFunc_RandomFloatInRange_ReturnValue) == 0x000104, "Member 'DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic, Temp_byte_Variable_8) == 0x000108, "Member 'DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic, K2Node_Select_Default) == 0x000109, "Member 'DailyRewardsEpic_C_ExecuteUbergraph_DailyRewardsEpic::K2Node_Select_Default' has a wrong offset!");

}

