#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmbeddedCommunicationJSBridge

#include "Basic.hpp"

#include "WebBrowser_structs.hpp"


namespace SDK::Params
{

// Function EmbeddedCommunicationJSBridge.EmbeddedCommunicationJSBridge.PostMessage
// 0x0038 (0x0038 - 0x0000)
struct EmbeddedCommunicationJSBridge_PostMessage final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Subsystem;                                         // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Command;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 JsonParams;                                        // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EmbeddedCommunicationJSBridge_PostMessage) == 0x000008, "Wrong alignment on EmbeddedCommunicationJSBridge_PostMessage");
static_assert(sizeof(EmbeddedCommunicationJSBridge_PostMessage) == 0x000038, "Wrong size on EmbeddedCommunicationJSBridge_PostMessage");
static_assert(offsetof(EmbeddedCommunicationJSBridge_PostMessage, ID) == 0x000000, "Member 'EmbeddedCommunicationJSBridge_PostMessage::ID' has a wrong offset!");
static_assert(offsetof(EmbeddedCommunicationJSBridge_PostMessage, Subsystem) == 0x000010, "Member 'EmbeddedCommunicationJSBridge_PostMessage::Subsystem' has a wrong offset!");
static_assert(offsetof(EmbeddedCommunicationJSBridge_PostMessage, Command) == 0x000018, "Member 'EmbeddedCommunicationJSBridge_PostMessage::Command' has a wrong offset!");
static_assert(offsetof(EmbeddedCommunicationJSBridge_PostMessage, JsonParams) == 0x000028, "Member 'EmbeddedCommunicationJSBridge_PostMessage::JsonParams' has a wrong offset!");

// Function EmbeddedCommunicationJSBridge.EmbeddedCommunicationJSBridge.RunCommand
// 0x0048 (0x0048 - 0x0000)
struct EmbeddedCommunicationJSBridge_RunCommand final
{
public:
	class FName                                   Subsystem;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Command;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 JsonParams;                                        // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWebJSResponse                         Response;                                          // 0x0028(0x0020)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EmbeddedCommunicationJSBridge_RunCommand) == 0x000008, "Wrong alignment on EmbeddedCommunicationJSBridge_RunCommand");
static_assert(sizeof(EmbeddedCommunicationJSBridge_RunCommand) == 0x000048, "Wrong size on EmbeddedCommunicationJSBridge_RunCommand");
static_assert(offsetof(EmbeddedCommunicationJSBridge_RunCommand, Subsystem) == 0x000000, "Member 'EmbeddedCommunicationJSBridge_RunCommand::Subsystem' has a wrong offset!");
static_assert(offsetof(EmbeddedCommunicationJSBridge_RunCommand, Command) == 0x000008, "Member 'EmbeddedCommunicationJSBridge_RunCommand::Command' has a wrong offset!");
static_assert(offsetof(EmbeddedCommunicationJSBridge_RunCommand, JsonParams) == 0x000018, "Member 'EmbeddedCommunicationJSBridge_RunCommand::JsonParams' has a wrong offset!");
static_assert(offsetof(EmbeddedCommunicationJSBridge_RunCommand, Response) == 0x000028, "Member 'EmbeddedCommunicationJSBridge_RunCommand::Response' has a wrong offset!");

// Function EmbeddedCommunicationJSBridge.EmbeddedCommunicationJSBridge.SetEventListener
// 0x0020 (0x0020 - 0x0000)
struct EmbeddedCommunicationJSBridge_SetEventListener final
{
public:
	struct FWebJSFunction                         Callback;                                          // 0x0000(0x0020)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EmbeddedCommunicationJSBridge_SetEventListener) == 0x000008, "Wrong alignment on EmbeddedCommunicationJSBridge_SetEventListener");
static_assert(sizeof(EmbeddedCommunicationJSBridge_SetEventListener) == 0x000020, "Wrong size on EmbeddedCommunicationJSBridge_SetEventListener");
static_assert(offsetof(EmbeddedCommunicationJSBridge_SetEventListener, Callback) == 0x000000, "Member 'EmbeddedCommunicationJSBridge_SetEventListener::Callback' has a wrong offset!");

}

